УчетВУправляющихДляГит1/src/AccumulationRegisters/ПрочиеРасчеты/ПрочиеРасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеРасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтапПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ОтражениеЗарплатыВБухучете</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.ВыдачаДенежныхДокументов</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</types>
      <types>DocumentRef.ПерерасчетСтраховыхВзносов</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.Отпуск</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.АктПроверкиСтраховыхВзносов</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.РегламентнаяОперация</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.УдалитьОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.УдалитьРасчетЕСН</types>
      <types>DocumentRef.Партия</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УчетВУправляющихДляГит1/src/AccumulationRegisters/ПрочиеРасчеты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

Процедура ЗаменитьСчетПФР_ОПС_ИП() Экспорт
	
	СчетУчетаУдаленный = ПланыСчетов.Хозрасчетный.УдалитьПФР_ОПС_ИП;
	СчетУчетаНовый     = ПланыСчетов.Хозрасчетный.ПФР_ОПС_ИП;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетУчетаУдаленный", СчетУчетаУдаленный);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеРасчеты.Регистратор
	|ИЗ
	|	РегистрНакопления.ПрочиеРасчеты КАК ПрочиеРасчеты
	|ГДЕ
	|	ПрочиеРасчеты.СчетУчета = &СчетУчетаУдаленный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.ПрочиеРасчеты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.СчетУчета = СчетУчетаУдаленный Тогда
				Запись.СчетУчета = СчетУчетаНовый;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
